In [2]:
import pandas as pd
import numpy as np

In [18]:
df = pd.read_csv("globalAirQuality.csv")
print(df[df["aqi"] > 100])
print()
print(df[(df["aqi"] > 100) & (df["temperature"] > 30)])
print()
print()
print(df[(df["aqi"] > 100) & (df["temperature"] < 30)])

                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
6      2025-11-05 00:25:17.554219      US  New York    40.713    -74.006
7      2025-11-05 01:25:17.554219      US  New York    40.713    -74.006
8      2025-11-05 02:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17991  2025-11-19 09:25:17.554219      CH    Zurich    47.377      8.542
17993  2025-11-19 11:25:17.554219      CH    Zurich    47.377      8.542
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
6      77.690   65.198  20.302  7.641  62.687  0.734  155       36.729
7      57.816  111.709  34.533  6.945  41.304  0.771  115       37.891
8      60.914   44.775  40.936  6.779  36.751  1.014  121       24.092
...       ...      ...     ...    ...     ...    ...  ...          ...
17991  52.120   71.160  35.405  7.752  39.811  0.878  104       32.556
17993  76.613   37.495  29.662  5.419  57.042  1.103  153       20.437
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951

       humidity  wind_speed
0        70.168       3.725
3        89.153       8.956
6        47.651       4.542
7        53.314       7.605
8        48.148       8.686
...         ...         ...
17991    31.372       2.787
17993    79.602       2.663
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660

[9721 rows x 15 columns]

                        timestamp country      city  latitude  longitude  \
6      2025-11-05 00:25:17.554219      US  New York    40.713    -74.006
7      2025-11-05 01:25:17.554219      US  New York    40.713    -74.006
14     2025-11-05 08:25:17.554219      US  New York    40.713    -74.006
17     2025-11-05 11:25:17.554219      US  New York    40.713    -74.006
25     2025-11-05 19:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17947  2025-11-17 13:25:17.554219      CH    Zurich    47.377      8.542
17950  2025-11-17 16:25:17.554219      CH    Zurich    47.377      8.542
17975  2025-11-18 17:25:17.554219      CH    Zurich    47.377      8.542
17976  2025-11-18 18:25:17.554219      CH    Zurich    47.377      8.542
17991  2025-11-19 09:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
6      77.690   65.198  20.302  7.641  62.687  0.734  155       36.729
7      57.816  111.709  34.533  6.945  41.304  0.771  115       37.891
14     38.815  121.394  25.969  4.112  44.730  1.124  121       34.481
17     63.552   57.838  13.754  4.427  42.251  0.997  127       36.193
25     56.954   75.045  29.837  9.541  54.198  1.170  113       31.289
...       ...      ...     ...    ...     ...    ...  ...          ...
17947  53.938   75.183  16.255  7.263  67.244  0.457  107       32.584
17950  70.255   60.620  32.081  2.065  47.803  0.852  140       36.885
17975  33.406   98.160  44.654  0.807  45.160  0.737  111       30.761
17976  73.493   89.558   9.313  4.768  51.505  0.745  146       30.909
17991  52.120   71.160  35.405  7.752  39.811  0.878  104       32.556

       humidity  wind_speed
6        47.651       4.542
7        53.314       7.605
14       81.790       3.576
17       62.906       7.097
25       43.279       5.264
...         ...         ...
17947    81.544       7.101
17950    34.173       1.748
17975    76.073       3.570
17976    81.573       1.024
17991    31.372       2.787

[2384 rows x 15 columns]


                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
8      2025-11-05 02:25:17.554219      US  New York    40.713    -74.006
12     2025-11-05 06:25:17.554219      US  New York    40.713    -74.006
13     2025-11-05 07:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17988  2025-11-19 06:25:17.554219      CH    Zurich    47.377      8.542
17993  2025-11-19 11:25:17.554219      CH    Zurich    47.377      8.542
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
8      60.914   44.775  40.936  6.779  36.751  1.014  121       24.092
12     57.227   28.916  30.698  8.091  63.108  0.967  114       14.584
13     26.147   58.714  49.826  5.228  51.651  0.615  124       27.299
...       ...      ...     ...    ...     ...    ...  ...          ...
17988  61.305   97.044  23.317  6.793  57.102  1.022  122       13.982
17993  76.613   37.495  29.662  5.419  57.042  1.103  153       20.437
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951

       humidity  wind_speed
0        70.168       3.725
3        89.153       8.956
8        48.148       8.686
12       46.654       5.570
13       76.014       0.786
...         ...         ...
17988    30.822       6.769
17993    79.602       2.663
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660

[7337 rows x 15 columns]

In [25]:
print(df[df["aqi"] > 100] ["city"])
print()
print()
print(df[df["aqi"] > 100] [["city","aqi"]])
print()
print()
print()
print(df[(df["aqi"] > 100) & (df["temperature"] > 30)][["city" , "aqi" ]])

0        New York
3        New York
6        New York
7        New York
8        New York
           ...
17991      Zurich
17993      Zurich
17995      Zurich
17996      Zurich
17997      Zurich
Name: city, Length: 9721, dtype: object


           city  aqi
0      New York  108
3      New York  158
6      New York  155
7      New York  115
8      New York  121
...         ...  ...
17991    Zurich  104
17993    Zurich  153
17995    Zurich  103
17996    Zurich  105
17997    Zurich  122

[9721 rows x 2 columns]



           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]

In [31]:
aqi_data=df[(df["aqi"] > 100) & (df["temperature"] > 30)][["city" , "aqi" ]]
print(aqi_data)
print(aqi_data.iloc[0])# index value toh vhi sian start hogi 0 sian lkkin label nhi 
#print(aqi_data.loc[0])# error dega qki label 0 hein hi nhi 
print()
print()
print(aqi_data.loc[6])

           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]
city    New York
aqi          155
Name: 6, dtype: object


city    New York
aqi          155
Name: 6, dtype: object

In [42]:
#query method query return copyof data 
print(df.query("aqi >100 "))
print()
print()
print(df.query("aqi >100 & temperature > 30")[["city","aqi"]])
aqi_val = 100
print(df.query("aqi >@aqi_val & temperature > 30")[["city","aqi"]])

                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
6      2025-11-05 00:25:17.554219      US  New York    40.713    -74.006
7      2025-11-05 01:25:17.554219      US  New York    40.713    -74.006
8      2025-11-05 02:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17991  2025-11-19 09:25:17.554219      CH    Zurich    47.377      8.542
17993  2025-11-19 11:25:17.554219      CH    Zurich    47.377      8.542
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
6      77.690   65.198  20.302  7.641  62.687  0.734  155       36.729
7      57.816  111.709  34.533  6.945  41.304  0.771  115       37.891
8      60.914   44.775  40.936  6.779  36.751  1.014  121       24.092
...       ...      ...     ...    ...     ...    ...  ...          ...
17991  52.120   71.160  35.405  7.752  39.811  0.878  104       32.556
17993  76.613   37.495  29.662  5.419  57.042  1.103  153       20.437
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951

       humidity  wind_speed
0        70.168       3.725
3        89.153       8.956
6        47.651       4.542
7        53.314       7.605
8        48.148       8.686
...         ...         ...
17991    31.372       2.787
17993    79.602       2.663
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660

[9721 rows x 15 columns]


           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]
           city  aqi
6      New York  155
7      New York  115
14     New York  121
17     New York  127
25     New York  113
...         ...  ...
17947    Zurich  107
17950    Zurich  140
17975    Zurich  111
17976    Zurich  146
17991    Zurich  104

[2384 rows x 2 columns]

In [49]:
ds = pd.read_csv("employee_data.csv")

print(ds.isnull())
print()
print(ds.isna())
print()
print(ds.isnull().sum())

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

       id   name    age  country  gender  income
0   False  False  False    False   False   False
1   False  False  False    False   False   False
2   False  False   True    False   False   False
3   False  False   True    False   False   False
4   False  False  False    False   False    True
5   False  False  False    False   False   False
6   False   True  False    False   False   False
7   False  False  False     True   False   False
8   False  False  False    False   False   False
9   False  False   True    False   False   False
10  False  False  False    False    True   False

id         0
name       1
age        3
country    1
gender     1
income     1
dtype: int64

In [54]:
ds.dropna()#row drop

   id        name   age country  gender   income
0   1    John Doe  29.0     USA    Male  55000.0
1   1    John Doe  29.0     USA    Male  55000.0
5   5      Li Wei  27.0   China    Male  51000.0
8   8  Rachel Lee  29.0     USA  Female  62000.0

In [55]:
ds.dropna(axis=1)#columns drop in which a cell is empty

    id
0    1
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
10  10

In [56]:
ds.fillna(0)

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   0.0  Canada   Female  62000.0
3    3          Alex   0.0     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      0.0
5    5        Li Wei  27.0   China     Male  51000.0
6    6             0  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0       0     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   0.0  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA        0  58000.0

In [58]:
age_mean = ds["age"].mean()
ds["age"].fillna(age_mean)

0     29.00
1     29.00
2     32.75
3     32.75
4     34.00
5     27.00
6     45.00
7     38.00
8     29.00
9     32.75
10    31.00
Name: age, dtype: float64

In [59]:
ds

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
1    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [61]:
cleaned_data = ds.copy() 
cleaned_data["age"]= cleaned_data["age"].fillna(age_mean)
print(cleaned_data)

    id          name    age country   gender   income
0    1      John Doe  29.00     USA     Male  55000.0
1    1      John Doe  29.00     USA     Male  55000.0
2    2    Jane Smith  32.75  Canada   Female  62000.0
3    3          Alex  32.75     USA  Unknown  47000.0
4    4  Maria Garcia  34.00   Spain   Female      NaN
5    5        Li Wei  27.00   China     Male  51000.0
6    6           NaN  45.00   India   Female  73000.0
7    7    Ahmed Khan  38.00     NaN     Male  68000.0
8    8    Rachel Lee  29.00     USA   Female  62000.0
9    9   Carlos Ruiz  32.75  Mexico     Male  45000.0
10  10   Emily Davis  31.00     USA      NaN  58000.0

In [65]:
#handle duplicate
ds["country"].duplicated()
ds[["country","gender"]].duplicated()

0     False
1      True
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
dtype: bool

In [100]:
#ds.drop_duplicates()

In [101]:
#ds2=ds.copy()
#ds.drop_duplicates(inplace=True)

In [102]:
ds

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [95]:
#datatypes
ds.dtypes

id           int64
name        object
age        float64
country     object
gender      object
income     float64
dtype: object

In [96]:

ds2 = ds.copy()
ds2= ds2.fillna(0)
ds2["age"] = ds2["age"].astype("int64").copy()
ds2.dtypes

id           int64
name        object
age          int64
country     object
gender      object
income     float64
dtype: object

In [97]:
ds2

    id          name  age country   gender   income
0    1      John Doe   29     USA     Male  55000.0
2    2    Jane Smith    0  Canada   Female  62000.0
3    3          Alex    0     USA  Unknown  47000.0
4    4  Maria Garcia   34   Spain   Female      0.0
5    5        Li Wei   27   China     Male  51000.0
6    6             0   45   India   Female  73000.0
7    7    Ahmed Khan   38       0     Male  68000.0
8    8    Rachel Lee   29     USA   Female  62000.0
9    9   Carlos Ruiz    0  Mexico     Male  45000.0
10  10   Emily Davis   31     USA        0  58000.0

In [98]:
ds

    id          name   age country   gender   income
0    1      John Doe  29.0     USA     Male  55000.0
2    2    Jane Smith   NaN  Canada   Female  62000.0
3    3          Alex   NaN     USA  Unknown  47000.0
4    4  Maria Garcia  34.0   Spain   Female      NaN
5    5        Li Wei  27.0   China     Male  51000.0
6    6           NaN  45.0   India   Female  73000.0
7    7    Ahmed Khan  38.0     NaN     Male  68000.0
8    8    Rachel Lee  29.0     USA   Female  62000.0
9    9   Carlos Ruiz   NaN  Mexico     Male  45000.0
10  10   Emily Davis  31.0     USA      NaN  58000.0

In [104]:
aqi_data= pd.read_csv("globalAirQuality.csv")
print(aqi_data)

                        timestamp country      city  latitude  longitude  \
0      2025-11-04 18:25:17.554219      US  New York    40.713    -74.006
1      2025-11-04 19:25:17.554219      US  New York    40.713    -74.006
2      2025-11-04 20:25:17.554219      US  New York    40.713    -74.006
3      2025-11-04 21:25:17.554219      US  New York    40.713    -74.006
4      2025-11-04 22:25:17.554219      US  New York    40.713    -74.006
...                           ...     ...       ...       ...        ...
17995  2025-11-19 13:25:17.554219      CH    Zurich    47.377      8.542
17996  2025-11-19 14:25:17.554219      CH    Zurich    47.377      8.542
17997  2025-11-19 15:25:17.554219      CH    Zurich    47.377      8.542
17998  2025-11-19 16:25:17.554219      CH    Zurich    47.377      8.542
17999  2025-11-19 17:25:17.554219      CH    Zurich    47.377      8.542

         pm25     pm10     no2    so2      o3     co  aqi  temperature  \
0      50.295  108.938  27.998  6.539  52.568  1.096  108       18.504
1      32.083   63.043  36.120  4.021  43.536  1.075   90        5.838
2      42.250   82.553  26.935  9.538  23.320  0.977   84       31.833
3      30.403   79.951  63.536  7.609  31.369  0.230  158       23.140
4      21.083   66.423  38.997  6.919  45.615  1.085   97       13.632
...       ...      ...     ...    ...     ...    ...  ...          ...
17995  27.899   74.179  41.474  6.677  50.869  1.028  103        7.079
17996   2.950   47.988  42.235  2.821  35.551  0.644  105       28.734
17997  61.347   72.908  46.976  5.763  66.492  0.947  122       21.951
17998  40.722   95.152  32.957  5.524  53.193  0.868   95       24.042
17999  25.830   30.411  35.317  4.336  66.246  0.848   88        8.529

       humidity  wind_speed
0        70.168       3.725
1        80.088       8.969
2        62.783       9.650
3        89.153       8.956
4        76.499       4.017
...         ...         ...
17995    52.443       7.452
17996    85.678       4.496
17997    72.311       9.660
17998    31.880       2.642
17999    59.104       4.403

[18000 rows x 15 columns]

In [105]:
date = "2026-12-31"
print(type(date))

<class 'str'>

In [107]:
date = pd.Series(["2026-12-31"])
print(type(date))

<class 'pandas.core.series.Series'>

In [109]:
date = pd.Series(["2026-12-31"])
print(type(date.dtypes))

<class 'numpy.dtypes.ObjectDType'>

In [112]:
date = pd.Series([pd.to_datetime("2026-12-31")])
print(type(date.dtypes))

<class 'numpy.dtypes.DateTime64DType'>

In [113]:
# Handle Data Types
df = pd.read_csv("employee_data.csv") 

df.dtypes                                     # dtype of each col
df2 = df.fillna(0).copy()
df2["income"] = df2["income"].astype(int)       # change dtype

# String type
df2["gender"].str.lower()                      # lower case
df2["gender"].str.upper()                      # upper case
df2["gender"].str.capitalize()                 # capitalize

df2["gender"].str.capitalize()                 # capitalize
df2["name"].str.split(" ")                     # splits into lists based on separator value 
type(df2["name"].str.split(" ")[0])            

df2["country"].str.contains("US")
df2["country"].str.contains("india", case=False)

0     False
1     False
2     False
3     False
4     False
5     False
6      True
7       NaN
8     False
9     False
10    False
Name: country, dtype: object

In [114]:
# Transformation / Feature Engineering
df2 = df.copy()

# apply a fnx to a row or col
df2["tax"] = df2["income"].apply(lambda x : "10%" if x < 60000 else "20%")

# map values to another
new_gender_vals = {"Male": "M", "Female": "F", "Unknown": "U"}
df2["gender"] = df2["gender"].map(new_gender_vals)

# assign some new values
df2.assign(new_income = df2["income"] * 1.1)

# replace specific values
df2["country"].replace("USA", "United States of America")

0     United States of America
1     United States of America
2                       Canada
3     United States of America
4                        Spain
5                        China
6                        India
7                          NaN
8     United States of America
9                       Mexico
10    United States of America
Name: country, dtype: object

In [115]:
# Transformation - Sorting
df2 = df.copy()

# Renaming
df2.columns = ["Id", "Name", "Age", "Country", "Gender", "Income"]
df2.rename(columns= {"Income": "Salary"})
df2.rename(index={0: "first"})

# Sorting - values & index
df2.sort_values("Income")                     # sort values in ascending
df2.sort_values("Income", ascending=False)    # sort values in descending
df2.sort_values(["Age", "Income"])            # sorts for age, if age is same then sorts for income 

sorted_df2 = df2.sort_values(["Age", "Income"])
sorted_df2.sort_index()

# Reset Index
sorted_df2.reset_index()
sorted_df2.reset_index(drop=True)     # to drop original index vals

# Ranking
df2["Ranking"] = df2["Income"].rank(ascending=False, method="dense")

# Reorder
df2[["Id", "Name", "Age", "Income", "Gender", "Country", "Ranking"]]

    Id          Name   Age   Income   Gender Country  Ranking
0    1      John Doe  29.0  55000.0     Male     USA      5.0
1    1      John Doe  29.0  55000.0     Male     USA      5.0
2    2    Jane Smith   NaN  62000.0   Female  Canada      3.0
3    3          Alex   NaN  47000.0  Unknown     USA      7.0
4    4  Maria Garcia  34.0      NaN   Female   Spain      NaN
5    5        Li Wei  27.0  51000.0     Male   China      6.0
6    6           NaN  45.0  73000.0   Female   India      1.0
7    7    Ahmed Khan  38.0  68000.0     Male     NaN      2.0
8    8    Rachel Lee  29.0  62000.0   Female     USA      3.0
9    9   Carlos Ruiz   NaN  45000.0     Male  Mexico      8.0
10  10   Emily Davis  31.0  58000.0      NaN     USA      4.0

In [116]:
# Task - shift id column to end
df2 = df.copy()

new_col_order = [col for col in df.columns if col != "id"] + ["id"]
df2[new_col_order]

            name   age country   gender   income  id
0       John Doe  29.0     USA     Male  55000.0   1
1       John Doe  29.0     USA     Male  55000.0   1
2     Jane Smith   NaN  Canada   Female  62000.0   2
3           Alex   NaN     USA  Unknown  47000.0   3
4   Maria Garcia  34.0   Spain   Female      NaN   4
5         Li Wei  27.0   China     Male  51000.0   5
6            NaN  45.0   India   Female  73000.0   6
7     Ahmed Khan  38.0     NaN     Male  68000.0   7
8     Rachel Lee  29.0     USA   Female  62000.0   8
9    Carlos Ruiz   NaN  Mexico     Male  45000.0   9
10   Emily Davis  31.0     USA      NaN  58000.0  10